espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG13P/Include/efr32fg13p231f512gm48.h
#define CRYPTO_PRESENT          /**< CRYPTO is available in this part */
#define CRYPTO_COUNT          2 /**< 2 CRYPTOs available  */
#define TIMER_PRESENT           /**< TIMER is available in this part */
#define TIMER_COUNT           2 /**< 2 TIMERs available  */
#define WTIMER_PRESENT          /**< WTIMER is available in this part */
#define WTIMER_COUNT          1 /**< 1 WTIMERs available  */
#define USART_PRESENT           /**< USART is available in this part */
#define USART_COUNT           3 /**< 3 USARTs available  */
#define LEUART_PRESENT          /**< LEUART is available in this part */
#define LEUART_COUNT          1 /**< 1 LEUARTs available  */
#define LETIMER_PRESENT         /**< LETIMER is available in this part */
#define LETIMER_COUNT         1 /**< 1 LETIMERs available  */
#define PCNT_PRESENT            /**< PCNT is available in this part */
#define PCNT_COUNT            1 /**< 1 PCNTs available  */
#define I2C_PRESENT             /**< I2C is available in this part */
#define I2C_COUNT             2 /**< 2 I2Cs available  */
#define ADC_PRESENT             /**< ADC is available in this part */
#define ADC_COUNT             1 /**< 1 ADCs available  */
#define ACMP_PRESENT            /**< ACMP is available in this part */
#define ACMP_COUNT            2 /**< 2 ACMPs available  */
#define VDAC_PRESENT            /**< VDAC is available in this part */
#define VDAC_COUNT            1 /**< 1 VDACs available  */
#define WDOG_PRESENT            /**< WDOG is available in this part */
#define WDOG_COUNT            2 /**< 2 WDOGs available  */
#define IDAC_PRESENT            /**< IDAC is available in this part */
#define IDAC_COUNT            1 /**< 1 IDACs available  */
#define TRNG_PRESENT            /**< TRNG is available in this part */
#define TRNG_COUNT            1 /**< 1 TRNGs available  */
#define MSC_PRESENT             /**< MSC is available in this part */
#define MSC_COUNT             1 /**< 1 MSC available */
#define EMU_PRESENT             /**< EMU is available in this part */
#define EMU_COUNT             1 /**< 1 EMU available */
#define RMU_PRESENT             /**< RMU is available in this part */
#define RMU_COUNT             1 /**< 1 RMU available */
#define CMU_PRESENT             /**< CMU is available in this part */
#define CMU_COUNT             1 /**< 1 CMU available */
#define GPIO_PRESENT            /**< GPIO is available in this part */
#define GPIO_COUNT            1 /**< 1 GPIO available */
#define PRS_PRESENT             /**< PRS is available in this part */
#define PRS_COUNT             1 /**< 1 PRS available */
#define LDMA_PRESENT            /**< LDMA is available in this part */
#define LDMA_COUNT            1 /**< 1 LDMA available */
#define FPUEH_PRESENT           /**< FPUEH is available in this part */
#define FPUEH_COUNT           1 /**< 1 FPUEH available */
#define GPCRC_PRESENT           /**< GPCRC is available in this part */
#define GPCRC_COUNT           1 /**< 1 GPCRC available */
#define CRYOTIMER_PRESENT       /**< CRYOTIMER is available in this part */
#define CRYOTIMER_COUNT       1 /**< 1 CRYOTIMER available */
#define CSEN_PRESENT            /**< CSEN is available in this part */
#define CSEN_COUNT            1 /**< 1 CSEN available */
#define LESENSE_PRESENT         /**< LESENSE is available in this part */
#define LESENSE_COUNT         1 /**< 1 LESENSE available */
#define RTCC_PRESENT            /**< RTCC is available in this part */
#define RTCC_COUNT            1 /**< 1 RTCC available */
#define PRORTC_PRESENT          /**< PRORTC is available in this part */
#define PRORTC_COUNT          1 /**< 1 PRORTC available */
#define ETM_PRESENT             /**< ETM is available in this part */
#define ETM_COUNT             1 /**< 1 ETM available */
#define BOOTLOADER_PRESENT      /**< BOOTLOADER is available in this part */
#define BOOTLOADER_COUNT      1 /**< 1 BOOTLOADER available */
#define SMU_PRESENT             /**< SMU is available in this part */
#define SMU_COUNT             1 /**< 1 SMU available */
#define DCDC_PRESENT            /**< DCDC is available in this part */
#define DCDC_COUNT            1 /**< 1 DCDC available */

#include "core_cm4.h"           /* Cortex-M4 processor and core peripherals */
#include "system_efr32fg13p.h"  /* System Header File */

/** @} End of group EFR32FG13P231F512GM48_Part */

/***************************************************************************//**
 * @defgroup EFR32FG13P231F512GM48_Peripheral_TypeDefs Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

#include "efr32fg13p_msc.h"
#include "efr32fg13p_emu.h"
#include "efr32fg13p_rmu.h"
#include "efr32fg13p_cmu.h"
#include "efr32fg13p_crypto.h"
#include "efr32fg13p_gpio_p.h"
#include "efr32fg13p_gpio.h"
#include "efr32fg13p_prs_ch.h"
#include "efr32fg13p_prs.h"
#include "efr32fg13p_ldma_ch.h"
#include "efr32fg13p_ldma.h"
#include "efr32fg13p_fpueh.h"
#include "efr32fg13p_gpcrc.h"
#include "efr32fg13p_timer_cc.h"
#include "efr32fg13p_timer.h"
#include "efr32fg13p_usart.h"
#include "efr32fg13p_leuart.h"
#include "efr32fg13p_letimer.h"
#include "efr32fg13p_cryotimer.h"
#include "efr32fg13p_pcnt.h"
#include "efr32fg13p_i2c.h"
#include "efr32fg13p_adc.h"
#include "efr32fg13p_acmp.h"
#include "efr32fg13p_vdac_opa.h"
#include "efr32fg13p_vdac.h"
#include "efr32fg13p_csen.h"
#include "efr32fg13p_lesense_st.h"
#include "efr32fg13p_lesense_buf.h"
#include "efr32fg13p_lesense_ch.h"
#include "efr32fg13p_lesense.h"
#include "efr32fg13p_rtcc_cc.h"
#include "efr32fg13p_rtcc_ret.h"
#include "efr32fg13p_rtcc.h"
#include "efr32fg13p_rtc_comp.h"
#include "efr32fg13p_rtc.h"
#include "efr32fg13p_wdog_pch.h"
#include "efr32fg13p_wdog.h"
#include "efr32fg13p_etm.h"
#include "efr32fg13p_idac.h"
#include "efr32fg13p_smu.h"
#include "efr32fg13p_trng.h"
#include "efr32fg13p_dma_descriptor.h"
#include "efr32fg13p_devinfo.h"
#include "efr32fg13p_romtable.h"

